app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.post_id = params[:post_id] unless @comment.post_id
    # Fail

    if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "a"], ["user_id", 2], ["post_id", 11], ["created_at", "2019-02-06 01:59:19.139239"], ["updated_at", "2019-02-06 01:59:19.139239"]]