app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "POST"], ["url", "asdasd"], ["content", "adsadas"], ["user_id", 2], ["created_at", "2019-02-06 00:22:00.242379"], ["updated_at", "2019-02-06 00:22:00.242379"]]

  def show
    @post = Post.find(params[:id])
    @author = User.find(@post.user_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]