app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def ensure_moderator
    @sub = Sub.find(params[:id])

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Way"], ["description", "subway"], ["user_id", 2], ["created_at", "2019-02-06 00:08:37.708182"], ["updated_at", "2019-02-06 00:08:37.708182"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "100% club"], ["description", "100100100100\r\n        "], ["updated_at", "2019-02-05 22:12:43.536536"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.user_id == current_user.id && @sub.update(sub_params)