app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ShWYQigbng5mtgWJZDBRiA"], ["updated_at", "2019-02-05 21:52:21.917676"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = generate_session_token
    self.save!